Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནི་བསྒོམ་པ་རྣམ་པར་འཇིག་པའོ་ཞེས་བྱ་བ་ནི་བསྒོམ་པ་མེད་པར་བྱེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This is “the disintegration of meditation” means it causes the nonexistence of meditation. “

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས།
en: Subhūti, you should look closely at a bodhisattva great being in this deep perfection of wisdom irreversible from progress toward awakening.”

source: འདི་ཕྱིར་མི་ལྡོག་པ་ཡིན་ནམ། འོན་ཏེ་མ་ཡིན་ཞེས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བརྟག་པར་བྱ་བའོ།
en: You should look closely at irreversible great bodhisattvas—because of this perfection of wisdom are they irreversible, or not? “

source: །དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མངོན་པར་ཞེན་པ་མེད་དམ་ཞེས་བྱ་བ་ནི་བརྟགས་པའི་མཚན་མ་སྟོན་སྟེ།
en: Is the bodhisattva great being not attached to this deep perfection of wisdom?” then teaches the causal signs to be looked at closely.

source: བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་ཞེས་བྱ་བ་ནས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཐར་ཐུག་པའི་བར་དང་།
en: It says “to this deep perfection of wisdom,” up to “the perfection of giving,” up to all “the emptinesses,” finishing with “the eighteen distinct attributes of a buddha,” up to “the knowledge of all aspects.”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བཤད་པ་ན་དེ་ལ་མངོན་པར་ཞེན་པ་མི་སྐྱེད་ཅིང་མི་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་མི་ལྡོག་པ་ཡིན་ནོ་ཞེས་ཡོངས་སུ་བརྟག་པར་བྱའོ།
en: So, “you should look closely” whether “the bodhisattva great beings” are “irreversible”—are not attached to those and do they not stand on those.

source: །ལ་ལ་རང་བཞིན་གྱིས་གཞན་གྱིས་སྨྲས་པ་ལ་སྙིང་པོར་འདུ་ཤེས་མི་སྐྱེད་དོ། །ལ་ལ་དད་པར་མི་འགྱུར་རོ། །ལ་ལ་དེ་ལ་ཆགས་པར་མི་འགྱུར་རོ།
en: Because of their disposition, about “what others have said” some do not perceive an essential point, some do not believe it, and some do not get attached.

source: །ཞེ་སྡང་བར་མི་འགྱུར་གྱི་བཏང་སྙོམས་སུ་གནས་པར་འགྱུར་རོ།
en: They do not get angry and remain in equanimity.

source: །ལ་ལ་རང་བཞིན་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་མ་བྲལ་བ་ཡིན་ནོ།
en: Some, because of their disposition, are “not separated from” the six perfections.

source: །ལ་ལ་ཆོས་ཟབ་མོ་ཐོས་ན་སྐྲག་པ་ལ་སོགས་པར་མི་འགྱུར་གྱི་གོང་ནས་གོང་དུ་མངོན་པར་དགའ་ཞིང་ཉན་པར་འགྱུར་བ་དང་འཛིན་པ་དང་། འཆང་བར་འགྱུར་ཏེ།
en: Some, when they have heard this deep doctrine, “do not tremble,” and so on; “delight in” it more and more; and listen, “take it up, and bear it in mind.”

source: ཡོན་ཏན་དེ་རྣམས་དང་ལྡན་ན་ཕྱིར་མི་ལྡོག་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should know that when they have those attributes they are irreversible from progress toward awakening. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་རྣམ་པར་བརྟག་པར་བྱའོ་ཞེས་བྱ་བ་ནི་མངོན་པར་རྟོགས་པའི་དུས་ན་ལྷག་མཐོང་གིས་རྣམ་པར་བརྟག་པའོ། །སྟོང་པ་ཉིད་ལ་གཞོལ་བ་དང་། སྟོང་པ་ཉིད་ལ་འབབ་པ་དང་།
en: Should think carefully about this deep perfection of wisdom”— “think carefully” with special insight during clear realization— “with a mindstream inclined to emptiness, tending to emptiness, and heading to emptiness.”

source: སྟོང་པ་ཉིད་ལ་བབ་པས་ཞེས་བྱ་བ་ནི་ཆུང་ངུ་དང་འབྲིང་པོ་དང་ཆེན་པོའི་དབང་གིས་ཚིག་གསུམ་མོ།
en: Those three statements are governed by small, middling, and big.

source: །སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་སོགས་པའི་ཆོས་ཉིད་ཀྱིས་མངོན་པར་རྟོགས་པར་བྱས་ནས་རྣམ་པར་བརྟག་པར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means they should think carefully, having come to a clear realization, through the true dharmic nature of “emptiness, signlessness, wishlessness, the unproduced, the unceasing, the absence of defilement, the absence of purification,” and so on.

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Suchness and its indivisibility Having said that, The elder Subhūti inquired, “Lord, do they also think about form?”

source: གནས་བརྟན་རབ་འབྱོར་གྱིས།
en: and so on. “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་སྟོང་པ་ཉིད་ལ་གཞོལ་བའི་བསམ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟོག་པར་འགྱུར་བ་དེ་བཞིན་དུ་གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱང་དེ་ལྟར་བརྟག་པར་བགྱི་འམ། འོན་ཏེ་མི་བགྱི་ཞེས་ཞུས་པ།
en: Lord, they thus think about this deep perfection of wisdom with a mind-stream inclined to emptiness. Should they similarly think about dharmas—form, feeling, perception, and so on—as well, or should they not?”

source: བཅོམ་ལྡན་འདས་ཅི་གཟུགས་ལ་རྟོག་པ་ལགས་སམ་ཞེས་བྱ་བ་ལ་སོགས་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཟུགས་ལ་རྟོག་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྟོན་ཏེ་མངོན་པར་རྟོགས་པའི་ཚེ་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མེད་པའི་ཕྱིར་སྣང་བར་མི་འགྱུར་རོ།
en: Then, the Lord said, “Subhūti, bodhisattva great beings do not think about form,” and so on, teaches that at the time of clear realization, dharmas—form and so on—do not appear because they are nonexistent things.

source: །དེ་བས་ན་གཟུགས་དང་ཚོར་བ་ལ་སོགས་པའི་ཆོས་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་མཐར་ཐུག་པ་རྣམས་ཀྱིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ནི་མེད་ཀྱི། དེ་དག་གི་དེ་བཞིན་ཉིད་མངོན་པར་རྟོགས་པར་འགྱུར་རོ།
en: Therefore, full awakening is not through the dharmas “form, feeling,” and so on, up to, finally, “the knowledge of all aspects,” but is the clear realization of their suchness.

source: །དེ་བཞིན་ཉིད་དེ་ཡང་ཐ་དད་པ་མ་ཡིན་ཏེ།
en: That suchness, furthermore, is not broken apart.

source: གཟུགས་ལ་སོགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཅིག་གོ།
en: The suchness of all dharmas, form and so on, and the suchness of the knowledge of all aspects are one.

source: །དེ་བས་ན་དེ་བཞིན་ཉིད་གཅིག་པའི་ཕྱིར་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་བརྟག་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that they “do not think about” the dharmas “form” and so on because the suchness is the same. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་སུས་ཀྱང་མ་བྱས། འགྱུར་བར་མ་བྱས།
en: Nobody has made the knowledge of all aspects, nobody has made it change.

source: གང་ནས་ཀྱང་མ་འོངས། གང་དུ་ཡང་མ་སོང་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྟོན་ཏེ། གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བྱ་བ་དང་འགྱུར་བའི་ཆོས་སམ། འོང་བ་དང་འགྲོ་བ་དང་། གནས་པ་དང་ལྡན་པའམ།
en: It has not come from anywhere, and is not going anywhere,” and so on, teaches that if the knowledge of all aspects were to be something that is made; or that changes; or that comes, goes, or remains; or is in one place but not another; or has a “number,” and so on, it would be a falsely imagined mental image, and then it might fully awaken to dharmas, form and so on.

source: ཉི་ཚེ་བའམ། གྲངས་ལ་སོགས་པ་དང་ལྡན་ན་ནི། ཀུན་བརྟགས་པའི་རྣམ་པར་འགྱུར་ཏེ། འོ་ན་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་སུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འགྱུར་བ་ཞིག་ན་གང་གི་ཕྱིར་དེའི་རྣམ་པ་དང་བྲལ་ཏེ། ནམ་མཁའི་ཆོས་ཅན་ཡིན་པ་དེའི་ཕྱིར་དེ་གཟུགས་ལ་སོགས་པར་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: But because it is separated from that mental image, is qualified by space, it cannot therefore fully awaken to form and so on.

source: །ལྷ་རྣམས་ཀྱིས་ཆོས་ཟབ་མོ་དེ་ལྟ་བུ་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པས་མངོན་པར་བསྔགས་ནས་དེ་བཞིན་ཉིད་དེ་ཉིད་དོན་ཐ་དད་པ་མེད་པར་སྨྲས་སོ།
en: Then, having heard this deep doctrine, “the gods,” with “Lord… this deep perfection of wisdom,” and so on, offer praise and say suchness is the true reality in which things are not different. “

source: །གང་ལ་གཉིས་ཀུན་དུ་རྒྱུ་བ་མེད་པ་དེ་ནི་ཆོས་རྣམས་ཀྱི་ཟབ་པ་ཉིད་དོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་ཡིན་ལ།
en: Here where the habitual idea of two does not exist is the deep state of dharmas.” Because all dharmas have suchness as their nature, and suchness is the same, it is customary to call it one; it is not customary to call it two. “

source: དེ་བཞིན་ཉིད་ཀྱང་གཅིག་པའི་ཕྱིར་གཅིག་རྒྱུ་བར་འགྱུར་གྱི། གཉིས་སུ་རྒྱུ་བར་མི་འགྱུར་རོ། །ནམ་མཁའ་ཟབ་པའི་ཕྱིར་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་སྔར་བསྟན་པ་ཉིད་དོ།
en: Because space is deep,” and so on, is just what has been explained before. “

source: །ཆོས་འདི་ནི་གཟུགས་གཟུང་བའི་སླད་དུ་བསྟན་པ་མ་ལགས། མི་གཟུང་བའི་སླད་དུ་ཡང་མ་ལགས་ཞེས་བྱ་བ་ནི།
en: This doctrine is not taught so form will be taken up or will not be taken up.”

source: འདི་གཟུགས་སོ་ཞེས་མཚན་མར་འཛིན་པ་ནི་གཟུང་བའོ།
en: Seizing on a causal sign—this is form—it is “taken up.”

source: །གཟུགས་མེད་དོ་ཞེས་རྣམ་པ་ཐམས་ཅད་དུ་སྐུར་པ་འདེབས་པ་ནི་མི་གཟུང་བའོ།
en: Over-negating in all respects—form does not exist—it is “not taken up.” “

source: །གཟུགས་ལ་ཐོགས་པ་མ་མཆིས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཆོས་ཐམས་ཅད་དང་རྗེས་སུ་མཐུན་པ་ཉིད་རྣམ་པར་བྱེད་དེ་གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ལ་སྒྲོ་འདོགས་པ་དང་སྐུར་པ་འདེབས་པའི་མཐའ་མེད་པའི་ཕྱིར་ཐོགས་པ་མེད་པ་འདི་ལྟར་ཀུན་བརྟགས་པའི་གཟུགས་ནི་ཡོད་པ་མ་ཡིན་པས་སྒྲོ་འདོགས་པའི་མཐའ་མེད་དོ།
en: This doctrine is not obstructed by form,” and so on. It is not obstructed because it frames a state in harmony with all dharmas, which is to say, it is not obstructed by any dharma, form and so on, because the two extremes of over-reification and over-negation are absent.

source: །ཆོས་ཉིད་ཀྱི་གཟུགས་ནི་ཡོད་པའི་ཕྱིར་སྐུར་པ་འདེབས་པ་མེད་དེ། དེ་བས་ན་གཟུགས་དང་རྗེས་སུ་མཐུན་པའོ།
en: Thus, because imagined form does not exist, the extreme of over-reification is absent, and because the true dharmic nature of form does exist, over-negation is absent, hence it is “in harmony with form.”

source: །དེ་བཞིན་དུ་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ། །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་མ་འོངས་མ་སོང་བ་སྟེ། དེ་བཞིན་དུ་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་མ་འོངས་མ་སོང་ཞེས་བྱ་བ་ལ་སོགས་པས་དེ་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དང་། རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དུ་སྟོན་ཏེ།
en: Similarly, for them all, “the suchness of form has not come and has not gone, and, similarly, the suchness of Subhūti has not come and has not gone,” and so on, teaches that the suchness of the Tathāgata and the suchness of Subhūti are the same.

source: རྗེས་སུ་སྐྱེས་པ་ཡིན་པར་བསྒྲུབ་པའི་ཕྱིར་མ་འོངས་མ་སོང་ཞེས་བྱ་སྨོས་ཏེ།
en: It says “has not come and has not gone” to establish that Subhūti “takes after the Lord.”

source: གང་ནས་ཀྱང་མ་འོངས། གང་དུ་ཡང་མ་སོང་བའོ།
en: He has not come from anywhere and does not go anywhere either. “

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་དེའོ། །ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་རབ་འབྱོར་དེ་བཞིན་ཉིད་ཀྱང་དེའོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་གཅིག་པའི་ཕྱིར་གཅིག་གོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Just that suchness of the Tathāgata is the suchness of all dharmas, and that suchness of all dharmas is the suchness of Subhūti.” This means they are one because suchness is the same. “

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གནས་པ་ཞེས་བྱ་བ་ནི་ཆོས་གནས་པའི་མཚན་ཉིད་དུ་ཡང་གཅིག་གོ་ཞེས་སྟོན་ཏོ།
en: The suchness of the Tathāgata is established” teaches that they are also one because of being marked by the establishment of dharmas. “

source: །འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་ཅེས་བྱ་བ་ལ། འགྱུར་བ་མེད་ཅེས་བྱ་བ་འདིས་ནི་མི་འགྱུར་བའི་ཡོངས་སུ་གྲུབ་པས་ཡོངས་སུ་གྲུབ་པར་སྟོན་ཏོ།
en: Is unchanging and undifferentiated”— this “unchanging” teaches that it is a thoroughly established phenomenon because it is the thoroughly established phenomenon that does not alter.

source: །རྣམ་པར་རྟོག་པ་མེད་ཅེས་བྱ་བ་འདིས་ནི་ཕྱིན་ཅི་མ་ལོག་པར་ཡོངས་སུ་གྲུབ་པས་ཡོངས་སུ་གྲུབ་པར་སྟོན་ཏོ།
en: This “undifferentiated” teaches that it is a thoroughly established phenomenon because it is the thoroughly established phenomenon without error. “

source: །ཅི་ལ་འང་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་ཁྱབ་པ་སྟེ། གང་ན་ཡང་ཡོད་པ་མ་ཡིན་ནོ།
en: Is not obstructed by anything”— it extends over all dharmas, which is to say, it does not exist anywhere at all.

source: །དེ་བས་ན་གང་གི་དེ་བཞིན་ཉིད་དུ་མ་གྱུར་པ་ཡང་མེད་དེ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “there is nothing of which that suchness is not the suchness.”

source: ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that it is also the suchness of all dharmas. “

source: །ནམ་ཡང་དེ་བཞིན་ཉིད་དུ་མ་གྱུར་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་དུས་ཐམས་ཅད་དུ་ཡང་དེ་བཞིན་ཉིད་དོ།
en: And it is never not suchness”— it is also suchness at all times.

source: །གཉིས་སུ་མེད་ཅེས་བྱ་བ་ནི་ངོ་བོ་ཉིད་གཅིག་པའོ། །དེ་གཉིས་སུ་བྱར་མེད་ཅེས་བྱ་བ་ནི་རྣམ་པ་གཉིས་སུ་དབྱེར་མི་ནུས་པའོ།
en: It “is not two” because it is the same basic nature, “and cannot be divided into two” because you cannot divide it into two types. “

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཐ་མི་དད་པ་དབྱེར་མེད་པ་གཉིས་སུ་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་ཐ་མི་དད་པར་དབྱེར་མེད་པ་དམིགས་སུ་མེད་པའོ།
en: Just as the suchness of the Tathāgata is not broken apart, is not different, and cannot be apprehended, so too the suchness of all dharmas is not broken apart, is not different, and cannot be apprehended.

source: །དེ་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་ཐ་མི་དད་པ་དབྱེར་མེད་པ་དམིགས་སུ་མེད་པ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་ཐ་མི་དད་དོ།
en: Similarly, the suchness of the elder Subhūti is not broken apart, is not different, and cannot be apprehended either.” This is teaching that the suchness of all dharmas, like the suchness of the Tathāgata, in its nature cannot be apprehended so is not different.

source: །ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་ཐ་མི་དད་དོ་ཞེས་སྟོན་ཏེ།
en: And the suchness of the elder Subhūti, like the suchness of all dharmas, also in its nature cannot be apprehended, so it is not different either.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གཉིས་སུ་མེད་པའི་ཕྱིར་ཐ་མི་དད་པ་དང་གཉིས་སུ་བྱར་མེད་པའི་ཕྱིར་དབྱེར་མེད་པ་དང་། དམིགས་སུ་མེད་པའི་ཕྱིར་ངོ་བོ་ཉིད་ཀྱིས་དམིགས་སུ་མེད་དེ་གཅིག་པ་དང་། ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་ཐ་མི་དད་དབྱེར་མེད་པ་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པ་དེ་བཞིན་དུ་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་ཐ་མི་དད་དེ། དབྱེར་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that just as the suchness of the Tathāgata cannot be broken apart because it is not two, is not different because it cannot be divided into two, and cannot be apprehended because in its nature it cannot be apprehended and hence is the same, and just as the suchness of all dharmas cannot be broken apart, is not different, and in its nature cannot be apprehended, so too the suchness of Subhūti cannot be broken apart and is not different either, because in its nature it too cannot be apprehended. “

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡོད་པ་མ་ཡིན་ཏེ། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡོད་པ་མ་ཡིན་པ་དེ་ནི་ནམ་ཡང་དེ་བཞིན་ཉིད་མ་ཡིན་པ་མ་ཡིན་ཞིང་།
en: The suchness of the Tathāgata is not other than the suchness of all phenomena, and what is not other than the suchness of all phenomena is never not suchness.

source: དེ་ནི་རྟག་ཏུ་དེ་བཞིན་ཉིད་དོ།
en: It is always suchness.

source: །གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་དེ་ལྟ་བུ་སྟེ།
en: The suchness of the elder Subhūti is like that.

source: དེའི་ཕྱིར་རྣམ་པ་གཞན་མ་ཡིན་པས་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་ཀྱང་གང་དུ་ཡང་རྗེས་སུ་སྐྱེས་པ་མེད་དོ་ཞེས་བྱ་བས་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དུ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་ཐ་མི་དད་དོ།
en: Therefore, since it is not something else, even though the elder Subhūti takes after the Tathāgata he does not take after him in anything.” This is teaching that just like the suchness of the Tathāgata, the suchness of all dharmas is also not broken apart because in its nature it cannot be apprehended.

source: དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གཞན་མ་ཡིན་ལ། གང་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གཞན་པ་མ་ཡིན་པ་དེ་ཡང་ནམ་ཡང་དེ་བཞིན་ཉིད་མ་ཡིན་པ་མ་ཡིན་ཏེ། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ནི་དུས་ཐམས་ཅད་དུ་ཡོད་པའི་ཕྱིར་རོ།
en: The suchness of the Tathāgata is not other than the suchness of all phenomena, and what is not other than the suchness of all phenomena is never not suchness, because the suchness of all phenomena is there at all times.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དེ་ལས་གཞན་མ་ཡིན་པའི་ཕྱིར། དུས་ཐམས་ཅད་དུ་ཡོད་དོ།
en: The suchness of the Tathāgata is not other than that, so it is there at all times.

source: །དེ་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གཞན་པ་མ་ཡིན་པའི་ཕྱིར་དུས་ཐམས་ཅད་དུ་ཡོད་དོ།
en: Similarly, the suchness of the elder Subhūti is not other than the suchness of all dharmas so it is there at all times.

source: །དེ་བས་ན་དུས་ཐམས་ཅད་དུ་ཡོད་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱི་རྗེས་སུ་སྐྱེས་པ་ཞེས་བྱའོ།
en: Therefore, since it is there at all times, he takes after the suchness of the Tathāgata.

source: །སྐྱེ་བའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་གང་དུ་ཡང་རྗེས་སུ་སྐྱེས་པ་མེད་པ་ཞེས་ཀྱང་བྱའོ།
en: Because he is not marked by birth, it also says “he does not take after him in anything.” “

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་འདས་པ་མ་ཡིན་མ་འོངས་པ་མ་ཡིན། ད་ལྟར་བྱུང་བ་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྟོན་ཏེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཀུན་བརྟགས་པའི་བདག་ཉིད་ཀྱིས་དུས་གསུམ་དུ་གཏོགས་ཀྱང་དེ་བཞིན་ཉིད་ནི་དུས་ཀྱིས་བསྡུས་པ་མ་ཡིན་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་ཀུན་བརྟགས་པའི་བདག་ཉིད་དུ་དུས་གསུམ་དུ་གཏོགས་ཀྱང་། དེ་དག་གིས་དེ་བཞིན་ཉིད་ནི་དུས་ཀྱིས་བསྡུས་པ་མ་ཡིན་ནོ།
en: Just as the suchness of the Tathāgata is not past, is not future, and is not present,” and so on, teaches that just as the Tathāgata with a falsely imagined nature is incorporated in the three time periods, but suchness is not included within time, so too all dharmas with a falsely imagined nature are incorporated in the three time periods but their suchness is not included within time.

source: །དེ་བཞིན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱི་དེ་བཞིན་ཉིད་ཀྱང་དུས་ཀྱིས་བསྡུས་པ་མ་ཡིན་ནོ།
en: In the same way the suchness of the elder Subhūti is not included within time either. “

source: །དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སྐྱེས་པ་ཞེས་བྱའོ།
en: Therefore, [he]… ‘takes after the Tathāgata.’ ” “

source: །ལྷའི་བུ་དག་འདི་ལ་འདས་པའི་དེ་བཞིན་ཉིད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་དུ་རིག་པར་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་སྟོན་ཏེ།
en: Gods, here you should know the suchness of the Tathāgata that is the same, through the suchness of the past that is the same.”

source: འདི་ལྟར་འདས་པའི་ཆོས་ཐམས་ཅད་ཀྱི་འདས་པའི་དེ་བཞིན་ཉིད་ངོ་བོ་ཉིད་གཅིག་པའི་ཕྱིར་མཉམ་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་མཉམ་མོ། །དེ་དག་ཀྱང་དེ་བཞིན་ཉིད་དེ་དང་བདག་ཉིད་གཅིག་པའི་ཕྱིར་མཉམ་མོ།
en: This is teaching: Thus, because the past suchness of all past phenomena has the same intrinsic nature it is the same, and therefore all tathāgatas are the same as well.

source: །གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་མཉམ་པ་དེ་ཉིད་ཀྱི་ཕྱིར་འདས་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་མཉམ་མོ།
en: They too have the same nature as that suchness, so they are also the same. Because of just this—the suchness of all the tathāgatas being the same—the suchness of past phenomena is therefore also the same.

source: དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གཅིག་པའི་ཕྱིར་རོ།
en: Because the suchness of the Tathāgata and the suchness of all phenomena are the same.

source: །ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་ཀྱང་མཉམ་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: Through the sameness of the suchness of all phenomena you should know the sameness of the suchness of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་ཀྱིས་འདས་པའི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: Through the sameness of the suchness of the Tathāgata you should know the sameness of all past phenomena.

source: །གཟུགས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་ཀྱིས་ཞེས་བྱ་བ་ལ་སོགས་པས་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དེ་ཉིད་རྒྱ་ཆེར་སྟོན་ཏོ།
en: On account of the sameness of the dharma of form,” and so on, teaches just that suchness of all phenomena in detail. “

source: །ལྷའི་བུ་དག་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པའི་དེ་བཞིན་ཉིད་འདི་ལ་བརྟེན་ནས་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་མཚན་ཐོབ་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དེ་ནི་ཡང་དག་པའི་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}སོ་ཞེས་འབྱུང་བའི་ཕྱིར་རོ།
en: Gods, thanks to this perfect suchness the Tathāgata… gets to be called Tathāgata.”

source: །རྣམ་པ་དྲག་ཏུ་གཡོས་ཞེས་བྱ་བ་ནི་གཡོ་བ་དང་།
en: As it has been said, “ ‘Tathāgata,’ Subhūti, is a word for true suchness.”

source: འགུལ་བ་དང་། ལྡེག་པ་དང་། ཆེམ་ཆེམ་པ་དང་། འུར་འུར་དང་། འཁྲུགས་ཞེས་བྱ་བ་རྣམ་པ་དྲུག་སྟེ།
en: Shaking of the universe “Shook in six ways”— the six are “quaked… shook… stirred… resounded… roared… and was disturbed.”

source: དེ་དག་ལས་ཆུང་ངུ་དང་འབྲིང་པོ་དང་ཆེན་པོའི་དབང་གིས་རེ་རེ་ལ་ཡང་རྣམ་པ་གསུམ་དུ་ཕྱེ་ན། མཚན་ལྟས་ཆེན་པོ་རྣམ་པ་བཅོ་བརྒྱད་དང་། ཕྱོགས་དྲུག་རྣམས་སུ་མཐོ་བ་དང་། དམའ་བའི་དབང་གིས་ཕྱོགས་སུ་གྱུར་པ་རྣམ་པ་བཅུ་གཉིས་ཏེ།
en: From them, when each has been subdivided into three based on small, middling, and big, there are the eighteen great omens and, based on the six directions rising up and sinking down, there are twelve to do with the directions.

source: དེ་དག་ཀྱང་གླེང་གཞིའི་ལེའུ་ཉིད་དུ་བཤད་ཟིན་ཏོ།
en: I have already discussed them in the Introduction chapter.

source: །དེ་ལ་གཡོས་པ་ལ་སོགས་པ་འདི་དག་ཀྱང་རྒྱུ་རྣམ་པ་གཉིས་ཀྱིས་འབྱུང་སྟེ་ལྷ་མཐུ་ཆེན་པོ་རྣམས་དམ་པའི་ཆོས་ཐོས་ནས་དགའ་ཞིང་མགུ་བ་སྐྱེས་པའི་མཐུས་ཕན་ཚུན་ཡོངས་སུ་འཁོར་ཞིང་འཁྲུགས་པ་དང་། ཆོས་ཉིད་ཀྱི་མཐུས་གནས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་ཆོས་ཀྱི་ཆེ་བའི་བདག་ཉིད་བསྟན་པའི་ཕྱིར་འདས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བཤད་པའི་ཆོས་ཉིད་ཀྱིས་དབང་དུ་གྱུར་པ་ཉིད་དུ་སྟོན་པ་ལྟ་བུར་གྱུར་པའོ། །དེ་ལ་ཕྱོགས་གཅིག་པར་རབ་ཏུ་ལྡེག་པ་ནི་གཡོ་བའོ།
en: There that “shaking” and so on comes about from two causes. When powerful gods hear the good doctrine, because of the force of the pleasure and delight that arises they dance around and excite each other; and, because of the force of the true dharmic nature, even the stable world, in order to demonstrate the greatness of the doctrine, becomes a demonstration, as it were, of obedience to the true dharmic nature the tathāgatas of the past have explained.

source: །ཤིང་ལྗོན་པ་བཞིན་བདག་ཉིད་ཐམས་ཅད་འགུལ་བ་ནི་འགུལ་བའོ། །མེ་མགལ་སྐོར་བ་བཞིན་དུ་འཁོར་བ་ནི་ལྡེག་པའོ། །སྒྲ་སྐད་རིང་དུ་འབྱུང་བའི་སྒྲ་ནི་ཆེམ་ཆེམ་མོ། །རྣམ་པར་འཁྲུག་པ་ནི་འཁྲུག་པའོ། །སྒྲ་བེར་བེར་པོ་ནི་འུར་འུར་རོ།
en: There shaking is a great quaking in one region;stirring is stirring in its entirety like a leafy tree; quaking is revolving like a fire brand swirling around; resounding is the noise of a long and drawn-out sound; disturbing is upsetting; and a roar is a piercing sound.

source: །ཡང་ན་ས་ནི་གཡོས་སོ། །ཤིང་ཐམས་ཅད་ནི་འགུལ་ལོ། །རི་ཐམས་ཅད་ནི་ལྡེག་གོ། །ལྷའི་རྔ་བོ་ཆེ་ལ་སོགས་པ་ནི་ཆེམ་ཆེམ་མོ། །རྒྱ་མཚོ་ལ་སོགས་པ་ནི་འཁྲུགས་སོ།
en: Alternatively, the earth shakes; all the trees stir; all mountains quake; the big drum of the gods and so on resounds; the ocean and so on is disturbed; and peals of thunder roar.

source: །འབྲུག་རྣམས་ནི་འུར་འུར་རོ། །དེ་དག་ཀྱང་དང་པོ་རྩོམ་པའི་ཚེ་ནི་དལ་ཞིང་མི་དྲག་པར་སྣང་ངོ་། །དེའི་འོག་ཏུ་ནི་དེ་བས་དྲག་གོ། །ཐ་མར་དེ་བས་ཀྱང་རབ་ཏུ་དྲག་སྟེ། རྣམ་པ་གསུམ་དུ་ཕྱེ་བས་བཅོ་བརྒྱད་དུ་འགྱུར་ཏེ།
en: Again, when they first occur, they appear soft and not forceful; after that they are more forceful than that; and finally they are much more forceful even than that, hence subdivided into three they become eighteen.

source: ཕྱོགས་རྣམས་ཀྱང་ཅིག་ཅར་མཐོ་བ་ལ་སོགས་པར་གྱུར་ན་མུགས་ཤིང་རྣམ་པར་ཞིགས་པ་བཞིན་དུ་རབ་ཏུ་འཁྲུགས་པར་འགྱུར་བའི་ཕྱིར་མཐར་གྱིས་མཐོ་བ་དང་དམའ་བར་གྱུར་ཏོ།
en: When the directions are raised up and so on simultaneously, they become greatly disturbed, as though the boundaries have burst and been destroyed. Hence, they rise up and sink down in a sequence.

source: །དེ་ལ་གང་གི་ཚེ་ཤར་ཕྱོགས་ཀྱི་ས་དང་། ཤིང་དང་རི་ལ་སོགས་པ་རབ་ཏུ་འཁྲུགས་པར་གྱུར་པ་དེའི་ཚེ་ཤར་ཕྱོགས་མཐོ་བ་འདྲ་བར་སྣང་ངོ་།
en: There when the ground, trees, and mountains and so on in the eastern direction are greatly disturbed it looks like the eastern direction is raised up.

source: །གང་གི་ཚེ་ཤར་ཕྱོགས་མཐོ་བར་སྣང་བ་དེའི་ཚེ་ནུབ་ཕྱོགས་རང་བཞིན་དུ་གནས་ཀྱང་དམའ་བ་འདྲ་བར་སྣང་བ་དེའི་ཚེ་ཤར་ཕྱོགས་མཐོ་ན་ནུབ་ཕྱོགས་དམའ་ཞེས་བྱའོ།
en: When it looks like the eastern direction is raised up, even though the western direction remains in its natural state it looks like it has sunk down.
